app/controllers/faqs_controller.rb

SELECT * FROM `faqs`
---
  def index
    @faqs = Faq.all

SELECT * FROM `faqs` WHERE (`faqs`.`id` = 1)
---
  def show
    @faq = Faq.find(params[:id])

SELECT * FROM `faqs` WHERE (`faqs`.`id` = 1)
---
  def edit
    @faq = Faq.find(params[:id])

INSERT INTO `faqs` (`created_at`, `updated_at`, `lang`, `question`, `answer`) VALUES('2010-04-30 19:02:09', '2010-04-30 19:02:09', 'en', 'How can chat support improve my sales?', 'Depending on type of your business...from assuring the transaction by walking your customer through the process, providing sales support even\r\nduring closing hours to making sure you do not loose your client when he gets confused on your web offering him an instant help.')
---
  def create
    @faq = Faq.new(params[:faq])

    respond_to do |format|
      if @faq.save

SELECT * FROM `faqs` WHERE (`faqs`.`id` = 1)
UPDATE `faqs` SET `updated_at` = '2010-07-19 09:28:44', `answer` = 'Depending on type of your business\r\nreasons range\r\nfrom assuring the transaction by walking your customer through the process\r\nor\r\nproviding sales\r\nsupport even during closing hours to making sure you do not loose your client when he gets confused on your web offering him an instant help.' WHERE `id` = 1
---
  def update
    @faq = Faq.find(params[:id])

    respond_to do |format|
      if @faq.update_attributes(params[:faq])