app/controllers/news_letters_controller.rb

  def index
    @news_letters = NewsLetter.all
---
SELECT * FROM `news_letters`

  def show
    redirect_to('/')
    @news_letter = NewsLetter.find(params[:id])
---
SELECT * FROM `news_letters` WHERE (`news_letters`.`id` = 1)

  def create
    @news_letter = NewsLetter.new(params[:news_letter])

    respond_to do |format|
      if @news_letter.save
---
INSERT INTO `news_letters` (`created_at`, `updated_at`, `email`) VALUES('2010-06-22 09:07:42', '2010-06-22 09:07:42', 'asdf')