app/controllers/pages_controller.rb

  def price
    @slogan = t(:slogan_prices)
    @title = t("Prices")
    @prices = Price.all
---
SELECT * FROM `prices`

  def faq
    @title = t("FAQ")
    @slogan = t(:slogan_faq)
    @faqs = Faq.all(:conditions=>{'lang'=> get_locale_mark})
---
SELECT * FROM `faqs` WHERE (`faqs`.`lang` IS NULL)