app/controllers/prices_controller.rb

SELECT * FROM `prices`
---
  def index
    @prices = Price.all

SELECT * FROM `prices` WHERE (`prices`.`id` = 1)
---
  def show
    @price = Price.find(params[:id])

SELECT * FROM `prices` WHERE (`prices`.`id` = 1)
---
  def edit
    @price = Price.find(params[:id])

INSERT INTO `prices` (`price`, `created_at`, `updated_at`, `hours`) VALUES(6, '2010-07-19 17:18:54', '2010-07-19 17:18:54', 8)
---
  def create
    @price = Price.new(params[:price])

    respond_to do |format|
      if @price.save