app/controllers/users_controller.rb

INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `role_id`, `fullname`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-07-20 11:54:23', '2010-07-20 11:54:23', '1f7f83fd2ce9e791e52dea4e8a721d9a5186acf1d3a7574c43ab4ea36a2bccd8da155ab49ed54f5db9b5078401a6096ba793fc2c1da77d6fb5bc7a82b92a911c', '2010-07-20 11:54:23', NULL, NULL, 0, '127.0.0.1', '5kvPIqSNAzno0vYKrbYE', '2010-07-20 11:54:23', 'ca465be0d56fdbfbdcbd8d0890533e6a04ae7cabec94f5bcf6681d3ca4c5115f4ea02606f6ad12d2091f72be2df58844f9533060cf777a35cd99128bf1af3586', 1, NULL, 'luigi', NULL, 'lukas.votypka@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save